#include <iostream>

// Задаю змінні, де х - кількість 
// горішків, що він може взяти за 
// хвилину; n - кількість тарілок;
// arr[5] - сам масив з кількість 
// горішків в кожній тарілці по 
// її номеру

int x = 5;
int n = 5;
int arr[5] = {5, 6, 10, 12, 14};


// Функція для прорахунку часу, 
// який знадобиться для збору 
// усіх горішків на усіх тарілках 
float calc_result(int n, int x, int arr[])
{
    float timer = 0.0;    // Таймер, 
// для запису часу, який 
// знадобився 
    float time_for_one_nut = 60 / x; // Час, за який він може взяти 1 
// горішок (для обрахунків необхідно)
    
    // Цикл з н-1 ітерацій, 
// пробігаємось по кожній тарілці 
    for (int i = 0; i < n; ++i)
        {
            int temp = arr[i];   
// Тимчасова змінна, в яку я 
// записую кількість горішків в 
// тарілці і з нею працюю далі 
            
//Цикл, що працює поки змінна temp > 0
            while(temp > 0)
            {
                if(temp >= x) // Якщо 
// горішків в тарілці більше чим х, 
// ми віднімаємо від темп число х 
// і додаємо хвилину на їх збір
                {
                    temp-=x;
                    timer+=60; // 1 хвилина на х горішків
                }
                else // В іншому випадку 
// ми віднімаємо по одному 
// горішку і додаємо час на збір 
// 1-го горішка
                {
                    temp-=1;
                    timer+=time_for_one_nut;
                }
            }
        }
        
     return timer;
}

int main()
{
    std::cout << calc_result(n, x, arr) << " seconds" << std::endl;
}